

#include <iostream>

using namespace std;



int main()
{
	setlocale(LC_ALL, "Russian");

	//Проверка на ввод положительного числа
	int x;
	cout << "Введите целое положительное значение: ";
	cin >> x;
	while (x < 0)
	{
		cout << "Введите целое положительное значение: ";
		cin >> x;
		if (true)
		{
			break;
		}
	}
	//Сумма числа от 1 до самого числа
	int i = 0;
	int sum = 0;
	for (i = 0; i <= x; i++)
	{
		sum = sum + i;
	}
	cout << "сумма от 1 до вашего числа: " << sum << endl;

	// создание и заполнение массива
	int arr[10];
	int a = 0;
	for (i = 10; i <= 19; i++)
	{
		arr[a] = i;
		a++;
	}
	cout << "ПЕРВОЕ ЧИСЛО: " << arr[0] << "\n" << "ВТОРОЕ ЧИСЛО: " << arr[1] << "\n" << "ТРЕТЬЕ ЧИСЛО: " << arr[2] << "\n" << "ЧЕТВЕРТОЕ ЧИСЛО: " << arr[3] << "\n" << "ПЯТОЕ ЧИСЛО: " << arr[4] << "\n" << "ШЕСТОЕ ЧИСЛО: " << arr[5] << "\n" << "СЕДЬМОЕ ЧИСЛО: " << arr[6] << "\n" << "ВОСЬМОЕ ЧИСЛО: " << arr[7] << "\n" << "ДЕВЯТОЕ ЧИСЛО: " << arr[8] << "\n" << "ДЕСЯТОЕ ЧИСЛО: " << arr[9] << "\n" << endl;


	//вывод значений элементов массива с четными индексами
	cout << "Четные номера массива: ";
	for (i = 0; i <= 9; i++)
	{
		if (i % 2 == 0)
		{
			cout << arr[i] << "," << " ";
		}
	}


	//сумма значений элементов массива с нечетными индексами
	sum = 0;
	for (i = 0; i <= 9; i++)
	{
		if (i % 2 != 0)
		{
			sum = sum + arr[i];
		}
	}
	cout << "\n" << "Сумма Нечетных номеров массива: " << sum << endl;
}
